<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"13c39a8626cd240d52a0188e8bdf4c04b9fbe98610e271deff3bddb41970ac4a","plan_job_ref":"Job Environment Main - Plan #33 at https://github.com/jarrod-lowe/wildsea/actions/runs/10336229334","plan_out_hash":"b12f40a167c02e1e30bf1c2e23dcdf399307847bbe6fb38831be80d593df5e5b","plan_hash":"baaf1caee2f95f3ef6dcbc0329ca7eed59e8cac98232073586af11f604f56343","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
aws_account  = (sensitive value)
aws_region   = (sensitive value)
environment  = "primary"
state_bucket = "terraform-state-021891603679"
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_dynamodb_table.table will be created
+   resource "aws_dynamodb_table" "table" {
+       arn                         = (known after apply)
+       billing_mode                = "PAY_PER_REQUEST"
+       deletion_protection_enabled = true
+       hash_key                    = "**"
+       id                          = (known after apply)
+       name                        = "Wildsea-primary"
+       range_key                   = "**"
+       read_capacity               = (known after apply)
+       stream_arn                  = (known after apply)
+       stream_label                = (known after apply)
+       stream_view_type            = (known after apply)
+       tags                        = {
+           "Name" = "Wildsea-primary"
        }
+       tags_all                    = {
+           "Application" = "Wildsea-primary"
+           "Name"        = "Wildsea-primary"
        }
+       write_capacity              = (known after apply)

+       attribute {
+           name = "PK"
+           type = "S"
        }
+       attribute {
+           name = "SK"
+           type = "S"
        }

+       point_in_time_recovery (known after apply)

+       server_side_encryption (known after apply)

+       ttl (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #33](https://github.com/jarrod-lowe/wildsea/actions/runs/10336229334)